#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_service.consumer_service will be created
  + resource "aws_ecs_service" "consumer_service" {
      + cluster                            = "staging"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "consumer-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + task_definition                    = (known after apply)

      + load_balancer {
          + container_name   = "consumer-service"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:538653532257:targetgroup/consumer-service-target/398d6c2abaf384b3"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0b6c758f00d70d9a5",
              + "sg-0f0b61f6ea9f636fb",
            ]
          + subnets          = [
              + "subnet-0ba62027c7b26273f",
            ]
        }

      + placement_strategy {
          + field = (known after apply)
          + type  = (known after apply)
        }
    }

  # aws_ecs_task_definition.consumer_service_task_def will be created
  + resource "aws_ecs_task_definition" "consumer_service_task_def" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + image             = "538653532257.dkr.ecr.eu-west-1.amazonaws.com/consumer-service:eded7dbc51cdf4781dbb2718aca74a7ba27e7a2c"
                  + logConfiguration  = {
                      + logDriver     = "awslogs"
                      + options       = {
                          + awslogs-group         = "/ecs/consumer-service"
                          + awslogs-region        = "eu-west-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                      + secretOptions = null
                    }
                  + memory            = 512
                  + memoryReservation = 256
                  + name              = "consumer-service"
                  + portMappings      = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::538653532257:role/ecsTaskExecutionRole"
      + family                   = "consumer-service"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + task_role_arn            = "arn:aws:iam::538653532257:role/ecs-task-default-role"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Check PR`, Action: `hashicorpterraform-github-actions3`, Working Directory: `terraform`, Workspace: `default`*
